Revit 2027 API
CoordinationModelElementProperty Properties
The CoordinationModelElementProperty type exposes the following members.
Properties
Name | Description
Group |  The name of the group of properties to which this property belongs to. E.g. Group = Identity Data.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Name |  The name of the property.
Value |  The value of the property provided as a string.
Top
See Also
Reference
CoordinationModelElementProperty Class
Autodesk.Revit.DB.ExternalData Namespace